// Задать номер четверти, показать диапазоны для возможных координат (№20)

Console.WriteLine();
Console.WriteLine("__________________________________________________________________________________________________________");
Console.WriteLine("Задание 20. Задать номер четверти, показать диапазоны для возможных координат");
Console.WriteLine("__________________________________________________________________________________________________________");
Console.WriteLine();

Console.Write("Введите № четверти - ");
double A = Convert.ToDouble(Console.ReadLine());

if (A == 1) Console.WriteLine("Диапазоны возможных координат: X > 0, Y > 0");
else if (A == 2) Console.WriteLine("Диапазоны возможных координат: X < 0, Y > 0");
else if (A == 3) Console.WriteLine("Диапазоны возможных координат: X < 0, Y < 0");
else if (A == 4) Console.WriteLine("Диапазоны возможных координат: X > 0, Y < 0");
else Console.WriteLine("Введен неверный № четверти");

Console.WriteLine();

